ShowTablesInExcel
Syntax
cDatabaseTables.ShowTablesInExcel
VB6 Procedure
Function ShowTablesInExcel (ByRef NumberSelectedLoadPatterns As Integer, ByRef LoadPatternList As As String()) As Integer
Parameters
TableKeyList
A zero-based array of the table keys for the tables to be included in the output.
WindowHandle
If a valid window handle is entered here Excel will be located in front of that window.
Remarks
Exports the specified tables to Excel.
Excel must be present on the computer for this function to work. If there is nothing to be shown in the table then no data is returned and Excel is not displayed.
Release Notes
Initial release in version 23.0.0
See Also